app/controllers/boards_controller.rb

SELECT "boards".* FROM "boards" INNER JOIN "board_assignments" ON "board_assignments"."board_id" = "boards"."id" WHERE (board_assignments.user_id = 2)
SELECT "cards".* FROM "cards" WHERE "cards"."list_id" IN (7)
SELECT "lists".* FROM "lists" WHERE "lists"."board_id" IN (3)
---
  def index
    @boards = Board.includes(:lists, :cards).for_member(current_user)

SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @board = Board.find(params[:id])

INSERT INTO "boards" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 14 Mar 2014 17:04:29 UTC +00:00], ["title", "First Board"], ["updated_at", Fri, 14 Mar 2014 17:04:29 UTC +00:00]]
---
  def create
    @board = current_user.boards.build(board_params)

    if @board.save

SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "boards" SET "title" = ?, "updated_at" = ? WHERE "boards"."id" = 4  [["title", "EDITED"], ["updated_at", Fri, 14 Mar 2014 20:09:32 UTC +00:00]]
---
  def update
    @board = Board.find(params[:id])
    @board.update_attributes(board_params)

SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "boards" WHERE "boards"."id" = ?  [["id", 3]]
---
  def destroy
    @board = Board.find(params[:id])
    @board.destroy