app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'yoshi.gillaspie@gmail.com' LIMIT 1
---
  def create
    user = User.find_by_email(params[:user][:email])

UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["session_token", nil], ["updated_at", Fri, 14 Mar 2014 20:00:02 UTC +00:00]]
---
  def destroy
    user = current_user

    if user.nil?
      redirect_to new_session_url
      return
    end

    session[:session_token] = nil
    user.session_token = nil
    user.save!